# Clustering Iris Species

## Goal

In this notebook we will
1. have a very brief introduction to Pandas
2. use Pandas to load the iris dataset
3. use our implementation of Kmeans to cluster the iris dataset into groups, and check their consistency with the original iris species
4. discuss how an appropriate number of groups for a given dataset can be determined

## A very brief introduction to Pandas

### Loading data

Read the file `Safari.csv` and save it in a variable named Safari

In [1]:
import pandas as pd
pd.set_option('max_columns',50)
pd.set_option('max_rows',10)
Safari = pd.read_csv("Safari.csv")

What is the number of rows and columns in this data?

In [2]:
Safari.shape

(20, 5)

To get an idea of what the data looks like, display some of its leading and tailing content

In [3]:
Safari.head()

       type  id  food consumption  water consumption  Age
0  Elephant  E1                42                105   40
1  Elephant  E2                41                122   15
2     Tiger  T1                12                 30    8
3     Tiger  T2                22                 35   11
4     Tiger  T3                18                 33    3

In [4]:
Safari.tail()

            type  id  food consumption  water consumption  Age
15          Lion  L3                21                 52   14
16          Lion  L4                14                 38    9
17  Hippopotamus  H1                42                 83   31
18  Hippopotamus  H2                47                 91   45
19  Hippopotamus  H3                41                 76   12

In [5]:
Safari.head(17)

        type  id  food consumption  water consumption  Age
0   Elephant  E1                42                105   40
1   Elephant  E2                41                122   15
2      Tiger  T1                12                 30    8
3      Tiger  T2                22                 35   11
4      Tiger  T3                18                 33    3
..       ...  ..               ...                ...  ...
12     Zebra  Z6                 6                 12   15
13      Lion  L1                12                 42    5
14      Lion  L2                22                 61   12
15      Lion  L3                21                 52   14
16      Lion  L4                14                 38    9

[17 rows x 5 columns]

Print the number of unique values in each of Safari's columns

In [6]:
Safari.nunique()

type                  5
id                   20
food consumption     14
water consumption    20
Age                  15
dtype: int64

Let's examine more closely one of te columns. Specifically, how many different types of animals are included in Safari?

In [7]:
Safari['type'].nunique()

5

What are the unique types of animals included in Safari?

In [8]:
Safari['type'].unique()

array(['Elephant', 'Tiger', 'Zebra', 'Lion', 'Hippopotamus'], dtype=object)

How many rows include each of Safari's unique types?

In [9]:
Safari['type'].value_counts()

Zebra           6
Tiger           5
Lion            4
Hippopotamus    3
Elephant        2
Name: type, dtype: int64

Compute a high-level statistical description of the columns in the Safari data (mean, std etc.)

In [10]:
Safari.describe()

       food consumption  water consumption        Age
count         20.000000          20.000000  20.000000
mean          21.050000          46.850000  18.050000
std           13.926404          32.251112  12.002083
min            4.000000          10.000000   3.000000
25%           11.750000          23.750000  10.750000
50%           16.000000          34.000000  14.500000
75%           29.000000          64.750000  24.500000
max           47.000000         122.000000  45.000000

Do the same for the Lion group alone

In [11]:
Lions = Safari[Safari['type']=='Lion']
Lions

    type  id  food consumption  water consumption  Age
13  Lion  L1                12                 42    5
14  Lion  L2                22                 61   12
15  Lion  L3                21                 52   14
16  Lion  L4                14                 38    9

In [12]:
Lions.describe()

       food consumption  water consumption       Age
count           4.00000           4.000000   4.00000
mean           17.25000          48.250000  10.00000
std             4.99166          10.340052   3.91578
min            12.00000          38.000000   5.00000
25%            13.50000          41.000000   8.00000
50%            17.50000          47.000000  10.50000
75%            21.25000          54.250000  12.50000
max            22.00000          61.000000  14.00000

We can acieve this also using a Pandas built in functionality

In [ ]:
gLionsSafari = Safari.groupby('type').get_group('Lion')
gLionsSafari

In [ ]:
gLionsSafari.describe()

Do the same for each of the unique animal types in the Safary

In [13]:
Safari.groupby('type').describe()

               Age                                                        \
             count       mean        std   min    25%   50%    75%   max
type
Elephant       2.0  27.500000  17.677670  15.0  21.25  27.5  33.75  40.0
Hippopotamus   3.0  29.333333  16.563011  12.0  21.50  31.0  38.00  45.0
Lion           4.0  10.000000   3.915780   5.0   8.00  10.5  12.50  14.0
Tiger          5.0   9.400000   4.393177   3.0   8.00  10.0  11.00  15.0
Zebra          6.0  21.833333   9.724539  12.0  15.00  19.0  27.50  37.0

             food consumption                                                 \
                        count       mean       std   min    25%   50%    75%
type
Elephant                  2.0  41.500000  0.707107  41.0  41.25  41.5  41.75
Hippopotamus              3.0  43.333333  3.214550  41.0  41.50  42.0  44.50
Lion                      4.0  17.250000  4.991660  12.0  13.50  17.5  21.25
Tiger                     5.0  17.800000  5.848077  12.0  12.00  18.0  22.00
Zebra                     6.0   8.333333  3.011091   4.0   6.50   8.5  10.50

                   water consumption                                        \
               max             count        mean        std    min     25%
type
Elephant      42.0               2.0  113.500000  12.020815  105.0  109.25
Hippopotamus  47.0               3.0   83.333333   7.505553   76.0   79.50
Lion          22.0               4.0   48.250000  10.340052   38.0   41.00
Tiger         25.0               5.0   31.600000   2.408319   29.0   30.00
Zebra         12.0               6.0   18.166667   5.946988   10.0   13.50


                50%     75%    max
type
Elephant      113.5  117.75  122.0
Hippopotamus   83.0   87.00   91.0
Lion           47.0   54.25   61.0
Tiger          31.0   33.00   35.0
Zebra          20.0   22.75   24.0

In [14]:
Safari.groupby('type').describe()['food consumption']

              count       mean       std   min    25%   50%    75%   max
type
Elephant        2.0  41.500000  0.707107  41.0  41.25  41.5  41.75  42.0
Hippopotamus    3.0  43.333333  3.214550  41.0  41.50  42.0  44.50  47.0
Lion            4.0  17.250000  4.991660  12.0  13.50  17.5  21.25  22.0
Tiger           5.0  17.800000  5.848077  12.0  12.00  18.0  22.00  25.0
Zebra           6.0   8.333333  3.011091   4.0   6.50   8.5  10.50  12.0

In [15]:
Safari.groupby('type').describe()['food consumption'][['min','max']]

               min   max
type
Elephant      41.0  42.0
Hippopotamus  41.0  47.0
Lion          12.0  22.0
Tiger         12.0  25.0
Zebra          4.0  12.0

## Iris data

Read the file `iris.csv` and save it in a DataFrame named iris

In [16]:
pd.set_option('max_columns',50)
pd.set_option('max_rows',10)
iris = pd.read_csv("iris.csv")

![](iris.jpg)

How many rows and columns does this data includes?

In [17]:
iris.shape

(150, 5)

To get an idea of what the data looks like, display some of its leading and tailing content

In [18]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [19]:
iris.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

Print the number of unique values in each of its columns

In [20]:
iris.nunique()

sepal_length    35
sepal_width     23
petal_length    43
petal_width     22
species          3
dtype: int64

How many different types of species does it include?

In [22]:
iris['species'].unique()
iris['species'].count()

150

What are the unique types of species?

In [23]:
iris['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

How many times does each unique specie appear in the iris data?

In [26]:
iris['species'].value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

Compute a high-level statistical description of the columns in the Safari data (mean, std etc.)

In [27]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

Do the same for the `setosa` group alone

In [29]:
setosa = iris.groupby('species').get_group('setosa')

In [30]:
setosa.describe()

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000    50.000000
mean        5.00600     3.428000      1.462000     0.246000
std         0.35249     0.379064      0.173664     0.105386
min         4.30000     2.300000      1.000000     0.100000
25%         4.80000     3.200000      1.400000     0.200000
50%         5.00000     3.400000      1.500000     0.200000
75%         5.20000     3.675000      1.575000     0.300000
max         5.80000     4.400000      1.900000     0.600000

Do the same for each of the unique iris species in the iris dataset

## Machine Learning with the iris dataset

1. Explain how the iris data can be used for classification 
    - what are the feature columns? 
    - what is the target column?
2. Explain how the iris dataset can be used for clustering

### Clustering the iris dataset

We'll use the same setup and environment we've used to develop our BNHP Kmeans

In [31]:
%matplotlib inline
import numpy as np
import matplotlib.pyplot as plt
from scipy.spatial.distance import cdist as distance

np.random.seed(0)

In [32]:
def Plot2dColoredSamples(X,Y,color=list('rgbckmy'),marker=['o'],PlotMeans = False):
    plt.figure(figsize=[7,7])
    uY = np.unique(Y)
    K = len(uY)
    for k in range(0,K):
        if len(marker)==1:
            plt.scatter(X[Y==uY[k],0], X[Y==uY[k],1], c=color[k], marker=marker[0], s=20)
            if PlotMeans:
                m = X[Y==k].mean(axis=0)
                plt.scatter(m[0], m[1], c=color[k], marker='$ ' + str(k) + '$', s=200)
        else:
            plt.scatter(X[Y==uY[k],0], X[Y==uY[k],1], c=color[k], marker='$' + marker[k] + '$', s=20)
            m = X[Y==k].mean(axis=0)
            plt.scatter(m[0], m[1], c=color[k], marker='$ C_{' + str(k) + '}$', s=200)
    plt.gca().set_aspect('equal', adjustable='box')
    return

In [33]:
def BNHP_KmeansWithDistortion(X, K, means=[], NumIterations = 20):
    # Init: for simplicity, we'll take the first K data points to initialize the cluster means
    # You can try replacing it with other initialization, and see what happens
    if len(means)==0:
        means = X[:K]
    # The code below implements the core logic of the Kmeans algorithm
    for _ in range(NumIterations):
        # line 1: compute the distance between each sample and every cluster center
#        distances = distance(means, X)
        distances = distance(X, means)
        # line 2: set the samples of group k to be all the points closest to Ck
#        labels = distances.argmin(axis=0)
        labels = distances.argmin(axis=1)
        # line 3: for each k set Ck to be the mean of all points in group k 
        means = [(X[labels==i].mean(axis=0)) for i in range(len(means))]
        
    distortion = [distance(X[labels==k],means[k].reshape(1,X.shape[1])).sum() for k in range(K)]
    return means, labels, distortion

Read the relevant values of the iris dataset into a feature matrix `X` and a target vector `Y`

In [34]:
X = iris[iris.columns[:4]].values
Y = iris['species'].values

Cluster the data into `K=3` groups using `BNHP_KmeansWithDistortion`

In [35]:
means, labels, distortions = BNHP_KmeansWithDistortion(X, 3)

For each cluster, find how many labels it has from each of the possible species, and associate it with this sepcie

Compute how aligned are the clusters with the original labels

The clusters are aligned with the underlying labels (with setose perfectly separated from the other two species)

### A note on choosing the number of clusters

Compute the total distortion reported by our implementation Kmeans for the following values of `K=[2,3,4,5,6,7,8,9]`, and plot it.

 Is there any observation that pops out?